In [1]:
#read libery 
import pandas as pd

In [2]:
#read one.csv file
df = pd.read_csv("one.csv")
df

       town  area   price
0     dhaka  2600  500000
1     dhaka  2700  600000
2     dhaka  3000  700000
3       ctg  2600  400000
4       ctg  2700  500000
5       ctg  3000  600000
6  noakhali  2600  300000
7  noakhali  2700  400000
8  noakhali  3000  500000

In [3]:
#separate town data
dummies=pd.get_dummies(df.town)
dummies

   ctg  dhaka  noakhali
0    0      1         0
1    0      1         0
2    0      1         0
3    1      0         0
4    1      0         0
5    1      0         0
6    0      0         1
7    0      0         1
8    0      0         1

In [4]:
#join separate file and orginal file
marged=pd.concat([df,dummies],axis='columns')
marged

       town  area   price  ctg  dhaka  noakhali
0     dhaka  2600  500000    0      1         0
1     dhaka  2700  600000    0      1         0
2     dhaka  3000  700000    0      1         0
3       ctg  2600  400000    1      0         0
4       ctg  2700  500000    1      0         0
5       ctg  3000  600000    1      0         0
6  noakhali  2600  300000    0      0         1
7  noakhali  2700  400000    0      0         1
8  noakhali  3000  500000    0      0         1

In [5]:
#delete town column data
final=marged.drop(['town'],axis='columns')
final

   area   price  ctg  dhaka  noakhali
0  2600  500000    0      1         0
1  2700  600000    0      1         0
2  3000  700000    0      1         0
3  2600  400000    1      0         0
4  2700  500000    1      0         0
5  3000  600000    1      0         0
6  2600  300000    0      0         1
7  2700  400000    0      0         1
8  3000  500000    0      0         1

In [6]:
#import model
from sklearn.linear_model import LinearRegression
model=LinearRegression()

In [7]:
# x value declar without price
x=final.drop('price',axis='columns')
x

   area  ctg  dhaka  noakhali
0  2600    0      1         0
1  2700    0      1         0
2  3000    0      1         0
3  2600    1      0         0
4  2700    1      0         0
5  3000    1      0         0
6  2600    0      0         1
7  2700    0      0         1
8  3000    0      0         1

In [8]:
# price value convert y
y=final.price
y

0    500000
1    600000
2    700000
3    400000
4    500000
5    600000
6    300000
7    400000
8    500000
Name: price, dtype: int64

In [9]:
#train model
model.fit(x,y)

LinearRegression()

In [10]:
# predict output
model.predict([[2600,0,1,0]])

array([523076.92307692])

In [11]:
#model score
model.score(x,y)

0.9615384615384617

# Using sklearn OneHotEncoder

In [12]:
df

       town  area   price
0     dhaka  2600  500000
1     dhaka  2700  600000
2     dhaka  3000  700000
3       ctg  2600  400000
4       ctg  2700  500000
5       ctg  3000  600000
6  noakhali  2600  300000
7  noakhali  2700  400000
8  noakhali  3000  500000

In [13]:
#import LabelEncoder
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [14]:
#town data tranfrom
dfle=df
dfle.town=le.fit_transform(dfle.town)
dfle

   town  area   price
0     1  2600  500000
1     1  2700  600000
2     1  3000  700000
3     0  2600  400000
4     0  2700  500000
5     0  3000  600000
6     2  2600  300000
7     2  2700  400000
8     2  3000  500000

In [15]:
# twon and area data convert to x
x=dfle[['town','area']].values
x

array([[   1, 2600],
       [   1, 2700],
       [   1, 3000],
       [   0, 2600],
       [   0, 2700],
       [   0, 3000],
       [   2, 2600],
       [   2, 2700],
       [   2, 3000]])

In [16]:
#price data convert y
y=dfle.price.values
y

array([500000, 600000, 700000, 400000, 500000, 600000, 300000, 400000,
       500000])

In [17]:
#import onehotencoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
ct = ColumnTransformer([('town', OneHotEncoder(), [0])], remainder = 'passthrough')

In [18]:
#x data transdorm
X= ct.fit_transform(x)
X

array([[0.0e+00, 1.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 2.7e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.0e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 2.7e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.0e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.7e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.0e+03]])

In [19]:
#model data train
model.fit(X,y)

LinearRegression()

In [20]:
#predict data check

model.predict([[0,1,0,2600]])

array([523076.92307692])

In [21]:
#predict score
model.score(X,y)

0.9615384615384613